import pandas and numpy

In [3]:
import pandas as pd
import numpy as np

dataframe

In [6]:
df=pd.DataFrame(np.arange(0,20).reshape(4,5),index=['row1','row2','row3','row4'],columns=['col1','col2','col3','col4','col5'])

In [7]:
print(df)

      col1  col2  col3  col4  col5
row1     0     1     2     3     4
row2     5     6     7     8     9
row3    10    11    12    13    14
row4    15    16    17    18    19

In [8]:
df.head()

      col1  col2  col3  col4  col5
row1     0     1     2     3     4
row2     5     6     7     8     9
row3    10    11    12    13    14
row4    15    16    17    18    19

converting to csv

In [10]:
df.to_csv('test_csv.csv')

accessing dataframe

In [11]:
df.loc['row2']

col1    5
col2    6
col3    7
col4    8
col5    9
Name: row2, dtype: int32

In [12]:
type(df.loc['row2'])

pandas.core.series.Series

In [13]:
df.iloc[:,:]

      col1  col2  col3  col4  col5
row1     0     1     2     3     4
row2     5     6     7     8     9
row3    10    11    12    13    14
row4    15    16    17    18    19

In [14]:
df.iloc[0:2,0:2]

      col1  col2
row1     0     1
row2     5     6

In [15]:
type(df.iloc[0:2,0:2])

pandas.core.frame.DataFrame

In [16]:
type(df.iloc[0:2,0])

pandas.core.series.Series

converting dataframe to array

In [24]:
df.iloc[:,0:2].values

array([[ 0,  1],
       [ 5,  6],
       [10, 11],
       [15, 16]])

In [34]:
df['col1']

row1     0
row2     5
row3    10
row4    15
Name: col1, dtype: int32

In [36]:
df[['col1','col2']]

      col1  col2
row1     0     1
row2     5     6
row3    10    11
row4    15    16

checking null values

In [26]:
df.isnull().sum()

col1    0
col2    0
col3    0
col4    0
col5    0
dtype: int64

checking categories in dataframes

In [32]:
df['col2'].value_counts()

1     1
6     1
11    1
16    1
Name: col2, dtype: int64

checking uniques values in dataframes

In [33]:
df['col1'].unique()

array([ 0,  5, 10, 15])

reading csv file

In [40]:
df=pd.read_csv("Sample100.csv")

getting information of csv

In [41]:
df.head()

,Serial Number,Company Name,Employee Markme,Description,Leave
0,9788189999599,TALES OF SHIVA,Mark,mark,0
1,9780099578079,1Q84 THE COMPLETE TRILOGY,HARUKI MURAKAMI,Mark,0
2,9780198082897,MY KUMAN,Mark,Mark,0
3,9780007880331,THE GOD OF SMAAL THINGS,ARUNDHATI ROY,4TH HARPER COLLINS,2
4,9780545060455,THE BLACK CIRCLE,Mark,4TH HARPER COLLINS,0

In [42]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 99 entries, 0 to 98
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Serial Number    99 non-null     int64
 1   Company Name     99 non-null     object
 2   Employee Markme  97 non-null     object
 3   Description      99 non-null     object
 4   Leave            99 non-null     int64
dtypes: int64(2), object(3)
memory usage: 4.0+ KB

In [43]:
df.describe()

       Serial Number      Leave
count   9.900000e+01  99.000000
mean    9.687307e+12   0.818182
std     9.827211e+11   2.158815
min     8.187776e+09   0.000000
25%     9.781743e+12   0.000000
50%     9.788185e+12   0.000000
75%     9.789382e+12   0.500000
max     9.789386e+12  10.000000

In [44]:
data=('col1,col2,col3\n' 'x,y,1\n' 'a,b,2\n' 'c,d,3\n')

In [45]:
print(data)

col1,col2,col3
x,y,1
a,b,2
c,d,3

In [46]:
type(data)

str

reading csv file from url

In [58]:
df1=pd.read_csv('https://download.bls.gov/pub/time.series/cu/cu.item',sep='\t')

In [59]:
df1.head()

,item_code,item_name,display_level,selectable,sort_sequence
0,AA0,All items - old base,0,T,2
1,AA0R,Purchasing power of the consumer dollar - old ...,0,T,400
2,SA0,All items,0,T,1
3,SA0E,Energy,1,T,375
4,SA0L1,All items less food,1,T,359

In [72]:
data1='{"employee_name":"James","email":"james@gmail.com","job_profile":[{"title":"Team Lead","title2":"Sr Developer"}]}'

In [73]:
df2 = pd.read_json(data1)

convert to json

In [67]:
df2.to_json()

'{"employee_name":{"0":"James"},"email":{"0":"james@gmail.com"},"job_profile":{"0":{"title":"Team Lead","title2":"Sr Developer"}}}'

In [66]:
df2.to_json(orient="records")

'[{"employee_name":"James","email":"james@gmail.com","job_profile":{"title":"Team Lead","title2":"Sr Developer"}}]'

In [74]:
df2.to_json(orient="index")

'{"0":{"employee_name":"James","email":"james@gmail.com","job_profile":{"title":"Team Lead","title2":"Sr Developer"}}}'

web scraping

In [83]:
url='https://icegate.gov.in/bank.html'

In [84]:
dfs=pd.read_html(url)

In [85]:
dfs[0]

    S.No.          Name of Banks
0     1.0              Axis Bank
1     2.0         Bank of Baroda
2     3.0          Bank of India
3     4.0    Bank of Maharashtra
4     5.0            Canara Bank
5     6.0  Central Bank of India
6     7.0              HDFC Bank
7     8.0             ICICI Bank
8     9.0              IDBI Bank
9    10.0            Indian Bank
10   11.0   Indian Overseas Bank
11   12.0       Karur Vysya Bank
12   13.0             Kotak Bank
13   14.0   Punjab National Bank
14   15.0      South Indian Bank
15   16.0    State Bank of India
16   17.0               UCO Bank
17   18.0    Union Bank of India

In [92]:
df_html=pd.read_html(url,match="Name of Banks",header=0)

In [93]:
print(df_html)

[    S.No.          Name of Banks
0     1.0              Axis Bank
1     2.0         Bank of Baroda
2     3.0          Bank of India
3     4.0    Bank of Maharashtra
4     5.0            Canara Bank
5     6.0  Central Bank of India
6     7.0              HDFC Bank
7     8.0             ICICI Bank
8     9.0              IDBI Bank
9    10.0            Indian Bank
10   11.0   Indian Overseas Bank
11   12.0       Karur Vysya Bank
12   13.0             Kotak Bank
13   14.0   Punjab National Bank
14   15.0      South Indian Bank
15   16.0    State Bank of India
16   17.0               UCO Bank
17   18.0    Union Bank of India]

Reading Excel

In [94]:
df_excel=pd.read_excel("sample3.xls")

In [95]:
df_excel.head()

   ID    Months  Unnamed: 2  ListMonths  Unnamed: 4  Unnamed: 5    Unnamed: 6
0   1   January         NaN           0         NaN         NaN  Select Month
1   2  February         NaN           0         NaN         NaN        August
2   3     March         NaN           0         NaN         NaN           NaN
3   4     April         NaN           0         NaN         NaN           NaN
4   0       NaN         NaN           0         NaN         NaN           NaN

pickling

In [96]:
df_excel.to_pickle('df_excel')

In [97]:
df_pickle=pd.read_pickle("df_excel")

In [98]:
df_pickle.head()

   ID    Months  Unnamed: 2  ListMonths  Unnamed: 4  Unnamed: 5    Unnamed: 6
0   1   January         NaN           0         NaN         NaN  Select Month
1   2  February         NaN           0         NaN         NaN        August
2   3     March         NaN           0         NaN         NaN           NaN
3   4     April         NaN           0         NaN         NaN           NaN
4   0       NaN         NaN           0         NaN         NaN           NaN